BOT_SETTINGS_RU = {
    "bot_intro_description": "Бот для любимых студентов платформы EXPAND ♥"
}

BOT_COMMANDS_RU = {
    "start": "Все команды бота",
    "schedule": "Когда мой урок?",
}

""" 
start - Все команды бота
schedule - Когда мой урок?
"""

BOT_MESSAGES_RU = {
    "start": [
# """Рад снова тебя видеть, {}! Чем могу помочь?""",
"""Рад снова тебя видеть! Чем могу помочь?""",
"""/schedule Когда следующий урок?
"""
    ],
    "schedule": [
"""*Суббота*

09:30
- Ира Г.
- Илья С.

11:00
- Артём Л.
- Дима Л.

12:30
- Кирилл К.
- Ярослав Г.
""",

"""*Воскресенье*

09:30
- Ира Г.
- Олег Г.

11:00
- Даня О.
- Кирилл К.
- Ярослав Г.

12:30
- Максим С.
- Назар С.
""",
"""До встречи в [зуме](https://us04web.zoom.us/j/5302871397?pwd=b1hVdmRKWXpvc3Vkblo5WkxmamVCdz09)"""
    ]
}


