BOT_SETTINGS_RU = {
    "bot_intro_description": "Бот для любимых студентов платформы EXPAND ♥"
}

BOT_COMMANDS_RU = {
    "start": "Все команды бота",
    "schedule": "Когда мой урок?",
    "payment": "Оплата",
    "clear_users": "Удалить всех юзеров из БД",
}

""" 
start - Все команды бота
schedule - Когда мой урок?
payment - Оплата
clear_users - Очистить БД пользователей
"""

BOT_MESSAGES_RU = {

"guest_welcome": """Привет, {}! 

Этот бот - приватный. Он создан для студентов курса EXPAND. 

Ты можешь посмотреть мой [ютуб](https://www.youtube.com/@expand_platform), [канал](https://t.me/expand_platform) и [сайт](https://expandplatform.com/) или написать мне [лично](https://t.me/best_prepod), чтобы записаться к нам на обучение""",

"create_account": [
"""Привет! Вижу, ты здесь в первый раз

Тогда минуточку..., 

Создаю для тебя аккаунт..., 
Это займёт примерно 5 секунд..."""],
# "create_account": [
# "Привет! Вижу, ты здесь в первый раз.",
# "Тогда минуточку...", 
# "Создаю для тебя аккаунт...", 
# "Это займёт примерно 5 секунд..."],

"welcome_greeting": "Привет, {}! \n\nЧем я могу помочь?",
"access_level": "Твой уровень доступа: {}",


"start": [
"""/schedule Когда следующий урок?

/payment Оплата
"""
],
    
"schedule": [
"""*Суббота*

*09:30*
- Ира Г.
- Илья С.

*11:00*
- Артём Л.
- Дима Л.

*12:30*
- Кирилл К.
- Ярослав Г.
""",

"""*Воскресенье*

*09:30*
- Ира Г.
- Олег Г.

*11:00*
- Даня О.
- Кирилл К.
- Ярослав Г.

*12:30*
- Максим С.
- Назар С.
""",
"""До встречи в [зуме](https://us04web.zoom.us/j/5302871397?pwd=b1hVdmRKWXpvc3Vkblo5WkxmamVCdz09)"""
    ],
    
"payment_amount": "Цена за этот месяц: {} грн",
"payment_status": "Ты (уже оплатил / ещё не оплатил) {} уроки в этом месяце",
#? Будет круто тут ещё поставить напоминания об оплате (кнопки: на этих выходных / в конце месяца)
}


