BOT_MESSAGES = {
    #? Chapter 1: introduction
    #? Step 1: language selection
    "step_1_language_selection": {
        "welcome_message": "Обери мову / Выбери язык",
        "reply_after_selection": "Я запам'ятав твій вибір 👌"
    },
    
    #? Chapter 1: introduction
    #? Step 2: name prompt
    "step_2_name_prompt": {
        "name_prompt": "Введи своє ім'я і я розповім, що потрібно робити для того, щоб отримати $30 від Даміра",
        "name_prompt_reply": "Радий знайомству, ",
    },
    
    
    #? Chapter 1: introduction
    #? Step 3: campaign details
    "step_3_campaign_details": {
        "details_intro": "Розказую тобі умови:",    
        "details_conditions": "1. Ти рекомендуєш мені друга чи подругу, який (або яка) цікавиться програмуванням \n\n2. Друг чи подруга записується на пробний, безкоштовний, урок \n\n3. Він чи вона оплачує перший місяць навчання \n\n4. Після оплати я надсилаю тобі гроші",   
        "details_end": "Звучить як план, що скажеш?",    
        
        "details_accepted_button": "Так",    
        "details_maybe_button": "Можливо",    
    }, 
    
    
    #? Chapter 1: introduction
    #? Step 4: user agreement
    # "step_4_user_agreement": {
    #     "success_call_to_action": "Тоді візьмешся за таке завдання? Якщо розібратись, воно не таке вже й складне. \n\nСкажу одразу: Дамір сказав, щоб я одразу ж допоміг тобі з пошуком студентів. Почнемо?",
    #     "maybe_call_to_action": "Можливо, ти подумав, що нікого не знайдеш? \n\nСкажу тобі по секрету: Дамір навчив мене допомагати вам з пошуком. \n\nДавай почнемо? Я розкажу все по ходу",
        
    #     "agree_button_text": "Чому й ні? Спробую",
    #     "not_sure_button_text": "Можливо, але пізніше",
        
    #     "agree_reply": "Чудово, радий чути! \n\nВідтепер ти - партнер Даміра по рекламі! 🎉\n\n Ти досяг рівня 1! \n\n Давай я допоможу тобі з пошуком першого студента. Ряд коротких питань та дій - і дійдеш до рівня 2!",
    #     "not_sure_reply": "Добре. Проте пам'ятай: можливості з'являються неочікувано і неочікувано зникають. \n\nНе варто відкладати на завтра те, на чому можна заробити сьогодні. "
    # }, 
    
},
    
BOT_COMMANDS = {
    "commands": {
        "start": "Все з початку",
    },
}
    
BOT_SETTINGS = {
    "bot_intro_description": "Допоможи Даміру знайти студента для його курсу програмування та отримай $30 доларів на карту банка. Ризикнеш?",
}