reward_amount = 1000


PARTNER_BOT_REPLIES = {
    'start': f"Привіт, партнере! 🤝\nЯ — рекламний агент Даміра. Дамір веде курси програмування та завжди в пошуку здібних та талановитих студентів. \n\nНапиши своє ім\'я і я розповім тобі, як ти можеш заробити {reward_amount} грн та отримати їх на карту👇",
}


ADMIN_BOT_REPLIES = {
    'start': 'Привіт, Дамір! Готовий почати?',
    'stats': 'Статистика за останній час:',
    'set_commands': "Команды обновлены! Перезапусти бота, чтобы проверить изменения",
}



# SHARED_BOT_REPLIES = {
#     'help': '\nЕсли есть вопросы или нашёл баг в боте, пиши мне в личку @best_prepod \n\nВыйти в меню: /menu',
# }
# merge objects
# PARTNER_BOT_REPLIES.update(SHARED_BOT_REPLIES)
# ADMIN_BOT_REPLIES.update(SHARED_BOT_REPLIES)
